Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/motor.c
};

// Motor internal data (including the previous defined GPIO configuration)
struct motor_priv_s motor_priv[6] =
{

{
  .cfg    = &(motor_cfg[0]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[1]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[2]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[3]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[4]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[5]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
}

};

/************************************************************************************
 * Private Functions
 ************************************************************************************/

/************************************************************************************
 * Helper macro
 ************************************************************************************/
#define motor_setpin(pin)           stm32_gpiowrite(pin,true)
#define motor_respin(pin)           stm32_gpiowrite(pin,false)

#define motor_emergency_stat()      (false)
#define motor_alarm_stat(cfg)       stm32_gpioread(cfg->alrm_pin)
#define motor_complete_stat(cfg)    stm32_gpioread(cfg->cmplt_pin)

#define motor_set_cw(cfg)           motor_setpin(cfg->dir_pin)
#define motor_set_ccw(cfg)          motor_respin(cfg->dir_pin)

#define motor_servo_on(cfg)         motor_setpin(cfg->srv_on_pin)
#define motor_servo_off(cfg)        motor_respin(cfg->srv_on_pin)

#define motor_led_red_on(cfg)       motor_setpin(cfg->led_red)
#define motor_led_red_off(cfg)      motor_respin(cfg->led_red)
#define motor_led_green_on(cfg)     motor_setpin(cfg->led_green)
#define motor_led_green_off(cfg)    motor_respin(cfg->led_green)

#define motor_get_pfm_count(motor)  (motor->pfm->ops->get_count(motor->pfm))
#define motor_stop_pfm(motor)       (motor->pfm->ops->stop(motor->pfm))
#define motor_is_idle(motor)        (motor->pfm->ops->is_idle(motor->pfm))
#define motor_start_pfm(motor,p,c)  (motor->pfm->ops->start(motor->pfm,p,c))

/************************************************************************************
 * Low-level Functions
 ************************************************************************************/

static inline void motor_alarm_res(FAR struct motor_cfg_s* cfg)
{
  /* Sending a pulse to reset alarm status */
  motor_setpin(cfg->alrm_res_pin);
  usleep(25000);      /* The datasheet specified 25mS(min) */
  motor_respin(cfg->alrm_res_pin);
}

static inline void motor_clr_devcount(FAR struct motor_cfg_s* cfg)
{
  /* Sending a pulse to clear deviation counter */
  motor_setpin(cfg->dev_clr_pin);
  usleep(25000);      /* The datasheet specified 25mS(min) */
  motor_respin(cfg->dev_clr_pin);
}

static int motor_init_gpio(FAR struct motor_cfg_s* cfg)
{
  int retval;

  /* Config GPIO pins */
  retval = stm32_configgpio(cfg->dir_pin);
  if(retval != OK)
  {
    return retval;
  }
  retval = stm32_configgpio(cfg->srv_on_pin);
  if(retval != OK)
  {
    return retval;
  }
  retval = stm32_configgpio(cfg->alrm_res_pin);
  if(retval != OK)
  {
    return retval;
  }
  retval = stm32_configgpio(cfg->dev_clr_pin);
  if(retval != OK)
  {
    return retval;
  }
  retval = stm32_configgpio(cfg->alrm_pin);
  if(retval != OK)
  {
    return retval;
  }
  retval = stm32_configgpio(cfg->cmplt_pin);
  if(retval != OK)
  {
    return retval;
  }
  retval = stm32_configgpio(cfg->led_red);
  if(retval != OK)
  {
    return retval;
  }
  retval = stm32_configgpio(cfg->led_green);
  return retval;
}

/************************************************************************************
 * Basic Functions
 ************************************************************************************/

/* State transition functions */
/* The driver has 4 states:
 *  - Uninitialized - The motor is not yet initialized
 *  - Unavailable - The motor has been initialized but is in "stop" mode
 *  - Alarm - The ALM signal from S-FLAG is set
 *  - Ready - The motor is ready to operate
 * At power-on, the driver is started within the state "Unintialized". Then, if all 
 * initialization steps are success, the state changes to "Ready". The ALRM signal
 * and EMERGENCY switch are hooked to GPIOs with initerrupt-on-change mode.
 * If the ALRM of a motor is asserted, the corresponding motor driver goes into "Alarm".
 * If the EMERGENCY switch is pushed (on), all motor drivers gos into "Unavailable".
 * The Alarm state can be cleared through the software, which, if success, put the
 * corresponding motor back to "Ready" state. However, the "Unavailable" state must
 * be cleared by releasing the EMERGENCY button. Clearing Unavailable state puts the
 * driver into "Uninitialzed" state that requires the full initialization steps again.
 * 
 * Transitioning from a state into another requires some operations. The following 
 * funtions are the operations needed to perform before entering each particular state.
/***********/
static int motor_enter_uninit(FAR struct motor_priv_s* priv)
{
  irqstate_t flags;
  uint32_t l;

  DEBUGASSERT(priv != NULL);

  _info(":M;%lu;%u;uninit\n", clock(), priv->cfg->motor_id);
  motor_servo_off(priv->cfg);
  if(priv->state == MOTOR_READY)
  {
    /* If motor was in ready state, then turn off PFM */
     if(priv->is_start)
    {
      l = motor_stop_pfm(priv);
      if(priv->is_cw)
        priv->step_count -= l;
      else
        priv->step_count += l;
      priv->is_start = false;
    }
 }
  motor_led_red_off(priv->cfg);
  motor_led_green_off(priv->cfg);
  flags = enter_critical_section();
  priv->state = MOTOR_UNINIT;
  leave_critical_section(flags);

  return OK;
}

