Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/motor.c
  return -EPERM;
}

/************************************************************************************
 * Name: motor_ioctl
 *
 * Description:
 *   The standard ioctl method.  This is where ALL of the motor work is done.
 *
 ************************************************************************************/

static int motor_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
  FAR struct inode          *inode = filep->f_inode;
  FAR struct motor_priv_s   *motor;
  int                        ret;
  uint32_t                   l;

  motor = inode->i_private;
  DEBUGASSERT(motor != NULL);

  /* Handle built-in ioctl commands */

  switch (cmd)
    {
      case MOTOR_CMD_INIT:
        ret = motor_enter_ready(motor);
        break;

      case MOTOR_CMD_SVOFF:
        //_info( ":M;%u;OFF\n", motor->cfg->motor_id);
        motor_servo_off(motor->cfg);
        ret = OK;
        break;

      case MOTOR_CMD_SVON:
        //_info( ":M;%u;ON\n", motor->cfg->motor_id);
        //_info( "Motor ON %u\n", motor->cfg->motor_id);
        motor_servo_on(motor->cfg);
        ret = OK;
        break;

      case MOTOR_CMD_RUN:
        {
          FAR struct motor_run_param_t *motor_run_param = (FAR struct motor_run_param_t *)arg;
          //_info( ":M;%u;spd=%lu;stp=%ld\n", motor->cfg->motor_id, motor_run_param->speed, motor_run_param->step );
          if(motor_run_param->speed >= MOTOR_MIN_SPEED &&
             motor_run_param->speed <= MOTOR_MAX_SPEED)
          {
            //_info("Run motor %u with speed %u and steps %d\n", motor->cfg->motor_id, motor_run_param->speed, motor_run_param->step);

            if( motor->is_start )
            {
              l = motor_stop_pfm(motor);
              if(motor->is_cw)
                motor->step_count -= l;
              else
                motor->step_count += l;
            }

            /* Counter-clockwise is considered as positive direction in this platform */
            if(motor_run_param->step < 0)
            {
              motor->is_cw = true;
              motor_set_cw(motor->cfg);
              motor_start_pfm(motor, motor_run_param->speed, (uint32_t)(-(motor_run_param->step)));
            }
            else
            {
              motor->is_cw = false;
              motor_set_ccw(motor->cfg);
              motor_start_pfm(motor, motor_run_param->speed, (uint32_t)(motor_run_param->step));
            }
            motor->is_start = true;

            ret = OK;
          }
          else
          {
            //_err("Unsupport RUN param with step=%d speed=%u\n", motor_run_param->step, motor_run_param->speed);
            //_info( ":M;%lu;%u;overflow;spd=%ld;stp=%ld\n", clock(), motor->cfg->motor_id, motor_run_param->step, motor_run_param->speed );
            ret = -ENOTSUP;
          }
        }
        break;

      case MOTOR_CMD_STOP:
        //_info( ":M;%u;STOP\n", motor->cfg->motor_id );
        l = motor_stop_pfm(motor);
        if(motor->is_cw)
          motor->step_count -= l;
        else
          motor->step_count += l;
        motor->is_start = false;
        ret = OK;
        break;

      case MOTOR_CMD_CLR_ALARM:
        //_info( ":M;%u;CLR_ALARM\n", motor->cfg->motor_id );
        if(motor->state == MOTOR_ALARM)
        {
          motor_alarm_res(motor->cfg);
          motor_clr_devcount(motor->cfg);
          usleep(2500);
          if(motor_alarm_stat(motor->cfg))
          {
            //_err("Alarm signal persists on motor %u\n", motor->cfg->motor_id);
            _err( ":M;%lu;%u;CLR_FAILED\n", clock(), motor->cfg->motor_id );
            ret = -EPERM;
          }
          else
          {
            ret = motor_enter_ready(motor);
          }
        }
        break;

      case MOTOR_CMD_GET_STATE:
        *( (motor_state_t*)arg ) = motor->state;
        ret = OK;
        break;

      case MOTOR_CMD_GET_STATUS:
        *( (uint32_t*)arg ) = 0;
        if(motor_complete_stat(motor->cfg))
        {
          *( (uint32_t*)arg ) |= 1;
        }
        *( (uint32_t*)arg ) <<= 1;
        if(motor_alarm_stat(motor->cfg))
        {
          *( (uint32_t*)arg ) |= 1;
        }
        *( (uint32_t*)arg ) <<= 1;
        if(motor_emergency_stat())
        {
          *( (uint32_t*)arg ) |= 1;
        }
        ret = OK;
        break;

      case MOTOR_CMD_GET_COUNTER:
        if(!(motor->is_start))
          *( (int32_t*)arg ) = motor->step_count;
        else
        {
          if(motor->is_cw)
            *( (int32_t*)arg ) = motor->step_count - motor_get_pfm_count(motor);
          else
            *( (int32_t*)arg ) = motor->step_count + motor_get_pfm_count(motor);
        }
        ret = OK;
        break;

      case MOTOR_CMD_IS_RUNNING:
        if(motor_is_idle(motor))
          *( (uint32_t*)arg ) = 0;
        else
          *( (uint32_t*)arg ) = 1;
        ret = OK;
        break;

      case MOTOR_CMD_RES_COUNTER:
        motor->step_count = 0;
        ret = OK;
        break;

      case MOTOR_CMD_SET_COUNTER:
        motor->step_count = *( (int32_t*)arg );
        ret = OK;
        break;

      /* Any unrecognized IOCTL commands might be platform-specific ioctl commands */

      default:
        {
          _err("Unrecognized cmd: %d arg: %ld\n", cmd, arg);
          ret = -ENOTSUP;
        }
        break;
    }

  return ret;
}


/************************************************************************************
 * Pubic Functions
 ************************************************************************************/

int motor_initialize()
{
  char devpath[15];

  /* 0. Configure Emergency signal */
  stm32_configgpio(GPIO_EMERGENGY_STOP);
  (void)stm32_gpiosetevent(GPIO_EMERGENGY_STOP, true, true,
                       false, motor_emergency, (void *)0);

  for(int i = 0;i < 6;i++)
  {
    _info("Initialize motor ID %d:..", i);

    /* 1. Init GPIO */
    if( motor_init_gpio(motor_priv[i].cfg) != OK )
    {
      _err("Failed to init GPIO\n");
      continue;  /* Skip this motor */
    }

    /* 2. Allocate pfm driver */
    motor_priv[i].pfm = stm32_pfm_init((motor_priv[i].cfg)->motor_id);

    if(motor_priv[i].pfm != NULL)
    {
      /* If PFM allocation is success */
      if( motor_enter_ready(&(motor_priv[i])) == OK)
      {
        _info("Entering READY...");
        (void)stm32_gpiosetevent((motor_priv[i].cfg)->alrm_pin, true, true,
                        false, motor_alarm, (void *)(&(motor_priv[i])));
        snprintf(devpath, 14, "/dev/motor%d", i);
        if(register_driver(devpath, &g_motorops, 0666, &(motor_priv[i])) != OK)
           _err("Unable to register %s\n", devpath);
        _info("Done\n");
      }
      else
      {
        motor_priv[i].state = MOTOR_UNAVAILABLE;
        _err("Failed to enter READY\n");
      }
    }
    else
    {
      motor_priv[i].state = MOTOR_UNAVAILABLE;
      _err("Failed to allocate PFM\n");
    }
  }

  /* Finally, check the emergency signal */
  if(motor_emergency_stat())
  {
    _alert(":M;A;EMERGENCY ASSERT!!!\n");
    /* Emergency button armed. Stop all motor and turn on all LEDs */
    for(int i = 0;i < 6;i++)
    {
      motor_enter_unavailable(&(motor_priv[i]));
    }
  }

  return OK;
}
